; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 809981 2 2 4 3 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	image3 - mode
	thermograph1 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(supports instrument1 image3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument2 image3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Phenomenon4)
	(have_image Phenomenon3 spectrograph2)
	(have_image Phenomenon4 image3)
	(have_image Star5 image3)
	(have_image Star6 image3)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 5
3. (turn_to satellite0 groundstation1 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
4. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   goals met: 0 of 5
5. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 5
6. (turn_to satellite1 phenomenon3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon3)
   goals met: 0 of 5
7. (turn_to satellite0 phenomenon4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 5
8. (turn_to satellite1 groundstation1 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 5
9. (take_image satellite0 phenomenon4 instrument1 image3)
   added: (have_image phenomenon4 image3)
   goals met: 2 of 5
10. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 5
11. (turn_to satellite0 star6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
12. (turn_to satellite1 phenomenon3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon3)
   goals met: 1 of 5
13. (take_image satellite1 phenomenon3 instrument2 spectrograph2)
   added: (have_image phenomenon3 spectrograph2)
   goals met: 2 of 5
14. (take_image satellite0 star6 instrument1 image3)
   added: (have_image star6 image3)
   goals met: 3 of 5
15. (turn_to satellite0 phenomenon4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon4)
   goals met: 4 of 5
16. (turn_to satellite1 star5 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 star5)
   goals met: 4 of 5
17. (take_image satellite1 star5 instrument2 image3)
   added: (have_image star5 image3)
   goals met: 5 of 5
